YoungSooBae1224/SensorShield-EVK-003-nRF52/BM1422AGMV/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Initialize clock driver.*/
void nrf52_clock_init(void) {

    ret_code_t err_code;
    err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function poiters to platform spesific functionality*/
void nrf52_platform_functions_init(void) {
  
    nrf52_funcs.twi_write     = nrf52_twi_write;
    nrf52_funcs.twi_read      = nrf52_twi_read;    
    nrf52_funcs.delay_ms      = nrf52_delay_ms;
    nrf52_funcs.debug_println = nrf52_debug_println;
}


/** @brief Handling application events from the scheduler. */
void application_event_handler(void * p_event_data, uint16_t event_size)
{
    uint8_t size;
    ret_code_t ret;
    uint8_t data[MAX_SENSOR_DATA_SIZE];
    uint16_t temp;
    int16_t comp_x, comp_y, comp_z; 
    char sensor_data[50]={0,};

    app_internal_evt_t *event = (app_internal_evt_t*)p_event_data;
    if(event->type == EVENT_READ_TWI)
    {
        ret = event->app_events.sensor_evt.sensor_read(data, &size);
        if (ret == NRF_SUCCESS)
        {
            if(offset_measure_flag == 0x1)
            {
                /* Add sensor ID check here for passing certain sensor data to USB or BLE*/
                if(event->app_events.sensor_evt.sensor_id == BM1422GMV_ID)
                {
                    temp = data[0]|data[1]<<8;
                    comp_x = (data[2]|data[3]<<8);
                    comp_y = (data[4]|data[5]<<8);
                    comp_z = (data[6]|data[7]<<8);


                    //sprintf(sensor_data,"%d/%d/%d/%d",temp,comp_x,comp_y,comp_z);
                    sprintf(sensor_data,"%d/%d/%d",comp_x,comp_y,comp_z);

                    int cnt;
                    for(cnt = 0 ; cnt < 256 ; cnt++)
                    {
                        if(sensor_data[cnt] == 0)
                        {
                            break;
                        }
                    }
                    NRF_LOG_INFO("%s",NRF_LOG_PUSH(sensor_data));
                    ble_uart_tx((uint8_t *)sensor_data, cnt);
                }
            }
            else
            {
                int16_t offset_data[6];
                for( int cnt = 0 ; cnt<3 ; cnt++ )
                {
                    offset_data[2*cnt] = data[2*cnt+2];
                    offset_data[2*cnt+1] = data[2*cnt+3];
                    int16_t off_d = offset_data[2*cnt]|(offset_data[2*cnt+1]<<8);
                    switch(cnt)
                    {
                        case 0:
                        {
                            if(diff_x > abs(off_d))
                            {
                                NRF_LOG_INFO("x off dat change %d -> %d",off_dat[0],wk_dat);
                                off_dat[0] = wk_dat;
                                diff_x = abs(off_d);
                                
                            }
                            break;
                        }
                        case 1:
                        {
                            if(diff_y > abs(off_d))
                            {
                                NRF_LOG_INFO("y off dat change %d -> %d",off_dat[1],wk_dat);
                                off_dat[1] = wk_dat;
                                diff_y = abs(off_d);
                            }
                            break;
                        }
                        case 2:
                        {
                            if(diff_z > abs(off_d))
                            {
                                NRF_LOG_INFO("z off dat change %d -> %d",off_dat[2],wk_dat);
                                off_dat[2] = wk_dat;
                                diff_z = abs(off_d);
                            }
                            break;
                        }
                        default:
                            break;
                    }
                }

                wk_dat++;

                if(wk_dat < 96)
                {
                    ret_code_t ret = BM1422GMV_offset_setting();
                    if (ret != NRF_SUCCESS) {
                        NRF_LOG_INFO("BM1422GMV_offset fail=%d", ret);
                    }
                }
                else
                {
                    NRF_LOG_INFO("END");
                    offset_measure_flag = 0x1;
                    gpio_pin_polarity_t interrupt_polarity = GPIO_POLARITY_HITOLO;
                    ret = BM1422GMV_start(BM1422GMV_INT1, interrupt_polarity);
                    if (ret != NRF_SUCCESS) {
                        NRF_LOG_INFO("BM1422GMV_start fail=%d", ret);
                        return;
                    }
                }
            }
        }
    }
}

/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;
    // Initialize.
    log_init();
    nrf52_clock_init();
    timers_init();
    nrf52_gpiote_init();

    /*Init scheduler, context swich from ISR to main.*/
    scheduler_init();
    
    buttons_leds_init(&erase_bonds);
    nrf52_twi_init();
    nrf52_platform_functions_init();
    sensors_init(&nrf52_funcs);

    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("Magneto Sensor application start.");
    advertising_start();

    // Enter main loop.
    for (;;)
    {
        app_sched_execute();
        idle_state_handle();
    }
}


/**
 * @}
 */
